Repository: nam27062002/learn-vocabulary
Catalog: locale/*/LC_MESSAGES/django.po
Languages: vi

source: Learn English
vi: Học Tiếng Anh

source: Home
vi: Trang chủ

source: Flashcards
vi: Thẻ từ vựng

source: Add Word
vi: Thêm từ

source: Study
vi: Học tập

source: Statistics
vi: Thống kê

source: Dashboard
vi: Bảng điều khiển

source: Welcome to LearnEnglish
vi: Chào mừng đến với LearnEnglish

source: Your personal vocabulary learning platform
vi: Nền tảng học từ vựng cá nhân của bạn

source: Total Cards
vi: Tổng số thẻ

source: Recent Cards
vi: Thẻ gần đây

source: Progress
vi: Tiến độ

source: Add New Words
vi: Thêm từ mới

source: Study Cards
vi: Học thẻ từ

source: Login
vi: Đăng nhập

source: Sign Up
vi: Đăng ký

source: Welcome back!
vi: Chào mừng trở lại!

source: Sign in to your account
vi: Đăng nhập vào tài khoản của bạn

source: Create Account
vi: Tạo tài khoản

source: Start your vocabulary learning journey
vi: Bắt đầu hành trình học từ vựng

source: Sign in with Google
vi: Đăng nhập với Google

source: Sign up with Google
vi: Đăng ký với Google

source: or
vi: hoặc

source: Email address
vi: Địa chỉ email

source: Password
vi: Mật khẩu

source: Confirm password
vi: Xác nhận mật khẩu

source: Remember me
vi: Ghi nhớ đăng nhập

source: Forgot password?
vi: Quên mật khẩu?

source: Sign in
vi: Đăng nhập

source: Sign up
vi: Đăng ký

source: Don't have an account?
vi: Chưa có tài khoản?

source: Already have an account?
vi: Đã có tài khoản?

source: We will send you a verification email to activate your account.
vi: Chúng tôi sẽ gửi email xác thực để kích hoạt tài khoản của bạn.

source: Logout
vi: Đăng xuất

source: Profile
vi: Hồ sơ

source: My Decks
vi: Các bộ thẻ

source: Back to all decks
vi: Quay lại tất cả bộ thẻ

source: Add Flashcard
vi: Thêm Flashcard

source: Add New Flashcard
vi: Thêm Flashcard Mới

source: Add new vocabulary to your collection
vi: Thêm từ vựng mới vào bộ sưu tập của bạn

source: My Flashcards
vi: Thẻ từ vựng của tôi

source: Your vocabulary collection
vi: Bộ sưu tập từ vựng của bạn

source: Term
vi: Từ vựng

source: TERM
vi: THUẬT NGỮ

source: Definition
vi: Định nghĩa

source: English Definition
vi: Định nghĩa tiếng Anh

source: DEFINITION (ENGLISH)
vi: ĐỊNH NGHĨA (ENGLISH)

source: Vietnamese Definition
vi: Định nghĩa tiếng Việt

source: DEFINITION (VIETNAMESE)
vi: ĐỊNH NGHĨA (VIETNAMESE)

source: PHONETIC
vi: PHÁT ÂM

source: Part of Speech
vi: Loại từ

source: Audio URL
vi: Đường dẫn Audio

source: Image
vi: Hình ảnh

source: Save
vi: Lưu

source: Save All
vi: Lưu tất cả

source: Save all Flashcards
vi: 💾 Lưu tất cả Flashcards

source: Delete
vi: Xóa

source: Add Another Card
vi: Thêm thẻ khác

source: Add new card
vi: ➕ Thêm thẻ mới

source: Upload image
vi: Tải ảnh lên

source: Drag to move card
vi: Kéo để di chuyển thẻ

source: Delete card
vi: Xóa thẻ

source: part of speech
vi: từ loại

source: Listen
vi: Nghe

source: Correct answer
vi: Đáp án

source: e.g., 'serendipity'
vi: ví dụ: 'serendipity'

source: A concise and clear definition...
vi: Định nghĩa rõ ràng và ngắn gọn...

source: Vietnamese translation...
vi: Bản dịch tiếng Việt...

source: Select deck:
vi: Chọn bộ thẻ:

source: -- Please select a deck --
vi: -- Vui lòng chọn một bộ thẻ --

source: -- Create new deck --
vi: -- Tạo bộ thẻ mới --

source: Total Decks
vi: Tổng số bộ thẻ

source: Average Cards per Deck
vi: Số thẻ trung bình mỗi bộ

source: Cards per Deck
vi: Số thẻ trong mỗi bộ

source: You have no decks yet.
vi: Bạn chưa có bộ thẻ nào.

source: Start Study
vi: Bắt đầu ôn

source: Select decks to study
vi: Chọn bộ thẻ để ôn

source: No cards due for review today.
vi: Hôm nay không có thẻ cần ôn.

source: Again
vi: Làm lại

source: Hard
vi: Khó

source: Good
vi: Tốt

source: Easy
vi: Dễ

source: Show Answer
vi: Hiện đáp án

source: Multiple Choice
vi: Trắc nghiệm

source: Type Answer
vi: Gõ đáp án

source: Select study mode
vi: Chọn chế độ học

source: Check
vi: Kiểm tra

source: Correct!
vi: Chính xác!

source: Incorrect
vi: Chưa đúng

source: Type your answer...
vi: Nhập đáp án...

source: Great job!
vi: Hoàn thành!

source: You have reviewed all due cards.
vi: Bạn đã ôn xong tất cả thẻ cần ôn.

source: Next Card →
vi: Thẻ tiếp theo →

source: Vietnamese meaning
vi: Nghĩa tiếng Việt

source: Listen and type the English word...
vi: Nghe và nhập từ tiếng Anh...

source: Please select at least one deck
vi: Vui lòng chọn ít nhất một bộ thẻ

source: Edit
vi: Chỉnh sửa

source: Cancel
vi: Hủy

source: Confirm
vi: Xác nhận

source: Loading...
vi: Đang tải...

source: Success
vi: Thành công

source: Error
vi: Lỗi

source: Try again
vi: Thử lại

source: Saving...
vi: Đang lưu...

source: Flashcard saved successfully
vi: Đã lưu thẻ từ thành công

source: Flashcard deleted successfully
vi: Đã xóa thẻ từ thành công

source: Error saving flashcard
vi: Lỗi khi lưu thẻ từ

source: Error deleting flashcard
vi: Lỗi khi xóa thẻ từ

source: Card updated successfully!
vi: Cập nhật thẻ thành công!

source: Error updating card
vi: Lỗi khi cập nhật thẻ

source: Are you sure you want to cancel? Unsaved changes will be lost.
vi: Bạn có chắc muốn hủy? Các thay đổi chưa lưu sẽ bị mất.

source: cards
vi: thẻ

source: You don't have any decks yet.
vi: Bạn chưa có bộ thẻ nào.

source: Get started by
vi: Bắt đầu bằng cách

source: adding some new flashcards
vi: thêm một số flashcard mới

source: This deck is empty.
vi: Bộ thẻ này trống.

source: Add some cards!
vi: Thêm một số thẻ!

source: 🎓 LearnEnglish App
vi: 🎓 Ứng dụng LearnEnglish

source: Welcome to the developer console!
vi: Chào mừng đến với console phát triển!

source: Built with Django + Tailwind CSS + JavaScript ❤️
vi: Được xây dựng với Django + Tailwind CSS + JavaScript ❤️

source: Search on Cambridge Dictionary
vi: Tìm kiếm trên Cambridge Dictionary

source: Continue
vi: Tiếp tục

source: Back to Login
vi: Quay lại Đăng nhập

source: No decks available
vi: Không có bộ thẻ nào

source: Edit Card
vi: Chỉnh sửa thẻ

source: Save Changes
vi: Lưu thay đổi

source: Edit Mode
vi: Chế độ chỉnh sửa

source: Has Audio
vi: Có âm thanh

source: No Audio
vi: Không có âm thanh

source: Audio Available
vi: Có âm thanh

source: Audio Missing
vi: Thiếu âm thanh

source: Add audio URL to enable pronunciation
vi: Thêm URL âm thanh để bật phát âm

source: Filter by Audio Status
vi: Lọc theo trạng thái âm thanh

source: Show All Cards
vi: Hiển thị tất cả thẻ

source: Cards with Audio
vi: Thẻ có âm thanh

source: Cards without Audio
vi: Thẻ không có âm thanh

source: Edit Deck Name
vi: Chỉnh sửa tên bộ thẻ

source: Deck Name
vi: Tên bộ thẻ

source: Save Name
vi: Lưu tên

source: Deck name updated successfully!
vi: Cập nhật tên bộ thẻ thành công!

source: Error updating deck name
vi: Lỗi khi cập nhật tên bộ thẻ

source: Deck name is required
vi: Tên bộ thẻ là bắt buộc

source: Fetch Missing Audio
vi: Lấy âm thanh thiếu

source: Fetching audio...
vi: Đang lấy âm thanh...

source: Audio fetched successfully!
vi: Lấy âm thanh thành công!

source: No audio found for some words
vi: Không tìm thấy âm thanh cho một số từ

source: Error fetching audio
vi: Lỗi khi lấy âm thanh

source: Audio fetch complete
vi: Hoàn thành lấy âm thanh

source: cards updated
vi: thẻ đã cập nhật

source: Auto-fetch audio for new cards
vi: Tự động lấy âm thanh cho thẻ mới

source: Study Mode
vi: Chế độ học tập

source: Normal Study (by Decks)
vi: Học bình thường (theo bộ thẻ)

source: Study Random Words
vi: Học từ ngẫu nhiên

source: Number of Words
vi: Số lượng từ

source: Available Words
vi: Từ có sẵn

source: Select Decks
vi: Chọn bộ thẻ

source: No decks selected
vi: Chưa chọn bộ thẻ nào

source: Correct
vi: Đúng

source: Enter your answer...
vi: Nhập đáp án của bạn...

source: View in Cambridge Dictionary
vi: Xem trong Cambridge Dictionary

source: No cards due
vi: Không có thẻ nào cần học

source: Back to Selection
vi: Quay lại lựa chọn

source: Play Audio
vi: Phát âm

source: Listen and type what you hear
vi: Nghe và viết những gì bạn nghe được

source: Type what you hear...
vi: Viết những gì bạn nghe được...

source: Replay
vi: Nghe lại

source: English:
vi: Tiếng Anh:

source: Vietnamese:
vi: Tiếng Việt:

source: Noun
vi: Danh từ

source: Verb
vi: Động từ

source: Adjective
vi: Tính từ

source: Adverb
vi: Trạng từ

source: Preposition
vi: Giới từ

source: Conjunction
vi: Liên từ

source: Interjection
vi: Thán từ

source: Pronoun
vi: Đại từ

source: Word is required
vi: Từ vựng là bắt buộc

source: At least one definition is required
vi: Cần ít nhất một định nghĩa

source: Method not allowed. Please refresh the page and try again.
vi: Phương thức không được phép. Vui lòng làm mới trang và thử lại.

source: Permission denied. Please refresh the page and try again.
vi: Không có quyền truy cập. Vui lòng làm mới trang và thử lại.

source: Card not found. Please refresh the page and try again.
vi: Không tìm thấy thẻ. Vui lòng làm mới trang và thử lại.

source: Server response error. Please try again.
vi: Lỗi phản hồi từ máy chủ. Vui lòng thử lại.

source: No definitions available
vi: Không có định nghĩa nào

source: Signed in as
vi: Đã đăng nhập với tư cách

source: Please select at least one deck to study.
vi: Vui lòng chọn ít nhất một bộ thẻ để học.

source: words
vi: từ

source: Study specific flashcard decks
vi: Học theo từng bộ thẻ cụ thể

source: Study random words from all decks
vi: Học từ ngẫu nhiên từ tất cả bộ thẻ

source: Sound Feedback
vi: Âm thanh phản hồi

source: Review Incorrect Words
vi: Ôn lại từ đã sai

source: Study words you previously answered incorrectly
vi: Học lại những từ bạn đã trả lời sai trước đây

source: incorrect words to review
vi: từ sai cần ôn lại

source: Practice words you answered incorrectly in their original question format until you master them.
vi: Luyện tập những từ bạn đã trả lời sai theo định dạng câu hỏi gốc cho đến khi thành thạo.

source: Start Review
vi: Bắt đầu ôn tập

source: Input Mode
vi: Nhập từ

source: Dictation Mode
vi: Chính tả

source: Congratulations!
vi: Chúc mừng!

source: You have successfully reviewed all incorrect words!
vi: Bạn đã ôn tập thành công tất cả các từ sai!

source: Continue Studying
vi: Tiếp tục học

source: Found:
vi: Tìm thấy:

source: Definitions
vi: Định nghĩa

source: Search flashcards...
vi: Tìm kiếm thẻ từ...

source: No flashcards found
vi: Không tìm thấy thẻ từ nào

source: Create your first flashcard
vi: Tạo thẻ từ đầu tiên

source: word found
vi: từ được tìm thấy

source: Definitions:
vi: Định nghĩa:

source: Play pronunciation
vi: Nghe phát âm

source: No audio available
vi: Không có audio

source: Delete flashcard
vi: Xóa flashcard

source: Are you sure you want to delete this flashcard?
vi: Bạn có chắc muốn xóa flashcard này không?

source: Error deleting flashcard:
vi: Lỗi khi xóa flashcard:

source: Unknown error
vi: Không rõ nguyên nhân

source: An error occurred while deleting flashcard:
vi: Đã xảy ra lỗi khi xóa flashcard:

source: Cannot play this audio
vi: Không thể phát audio này

source: Cannot play audio:
vi: Không thể phát audio:

source: Today
vi: Hôm nay

source: Yesterday
vi: Hôm qua

source: This week
vi: Tuần này

source: Last week
vi: Tuần trước

source: This month
vi: Tháng này

source: Last month
vi: Tháng trước

source: Language Test
vi: Test Ngôn Ngữ

source: Back to Dashboard
vi: Về Bảng Điều Khiển
